Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །འཁྲུལ་པ་མེད་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །གནས་དང་བརྡ་དང་ཀུན་རྫོབ་རྣམ་པར་དགོད་པ་དང་། སེམས་ཅན་དང་སེམས་ཅན་མ་ཡིན་པའི་ཆོས་རྣམ་པར་དགོད་པ་དང་། སངས་རྒྱས་དང་ཆོས་དང་འཕགས་པའི་དགེ་འདུན་རྣམ་པར་དགོད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows their constancy, their relative differen­tiation into signs of their condition, their differen­tiation into the qualities of beings and nonbeings, and the differen­tiation into the Buddha, the Dharma, and the higher Saṅgha.

source: །ནམ་མཁའི་ལུས་རྣམས་ཀྱི་ཚད་མྱེད་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “He knows the immeasurability of the bodies of space.

source: །ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་དང་། ལུས་མྱེད་པ་དང་། ནོར་བ་མེད་ཅིང་མཐའ་ཡས་པ་དང་། གཟུགས་མང་པོ་མངོན་ཞིང་གསལ་བར་བྱེད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows their omnipresence, their noncorporeality, their consistency, and their enabling the appearance of form bodies.

source: །དེས་ལུས་ཀྱི་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་དེ་ལྟ་བུ་རབ་ཏུ་ཐོབ་པས་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པར་ཚེ་བྱིན་གྱིས་བརླབ་པའི་ཕྱིར།
en: “Having thus attained the knowledge of bodies, he becomes powerful:

source: ཚེའི་དབང་རབ་ཏུ་འཐོབ་བོ།
en: (1) He attains power over his own lifespan because he has the power of manifesting an immeasurable lifespan of countless, incalculable eons.

source: །ཏིང་ངེ་འཛིན་ཤིན་ཏུ་རྟོགས་པའི་ཡེ་ཤེས་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་སེམས་ཅན་གྱི་དབང་རབ་ཏུ་འཐོབ་བོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱན་དུ་མས་རབ་ཏུ་བརྒྱན་ཅིང་ཤིན་ཏུ་ཀླུབས་པའི་བྱིན་གྱི་རླབས་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་ཡོ་བྱད་ཀྱི་དབང་རབ་ཏུ་འཐོབ་བོ།
en: ) He attains power over mind because he enters the wisdom of meditation in countless, immeasurable samādhis. (3) He attains the power over ornamentation because he displays the power of manifesting the beautification of all universes with an array of ornamentation.

source: །ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་བྱིན་གྱི་རླབས། དུས་བཞིན་དུ་མ་ནོར་བར་བསྟན་པའི་ཕྱིར་ལས་ཀྱི་དབང་རབ་ཏུ་འཐོབ་པོ།
en: (4) He attains power over karma because he displays the power of manifesting the ripening of karma at the appropriate time.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སྐྱེ་བ་ཡོངས་སུ་བསྟན་པའི་ཕྱིར་སྐྱེ་བའི་དབང་རབ་ཏུ་འཐོབ་པོ།
en: (5) He attains power over birth because he displays birth in all universes.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དང་དུས་གང་དུ་ཅི་དགའ་བར་མངོན་པར་འཚང་རྒྱ་བ་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་སྨོན་ལམ་གྱི་སྟོབས་རབ་ཏུ་འཐོབ་བོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སངས་རྒྱས་ཀྱིས་རབ་ཏུ་གང་བ་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་མོས་པའི་དབང་རབ་ཏུ་འཐོབ་བོ།
en: (6) He attains power over prayer because he displays complete buddhahood at the desired times in all universes.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་རྫུ་འཕྲུལ་གྱི་སྟོབས་རབ་ཏུ་འཐོབ་བོ།
en: (7) He attains power over aspiration because he displays all universes filled with buddhas. (8) He attains power over miracles because he displays emanations and miracles in all buddha realms.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་དང་། མངོན་པར་འཚང་རྒྱ་བ་ཡང་དག་པར་བསྟན་པའི་ཕྱིར། ཡེ་ཤེས་ཀྱི་དབང་རབ་ཏུ་འཐོབ་བོ། །མཐའ་དང་དབུས་མེད་པའི་ཆོས་ཀྱི་སྒོ་སྣང་བ་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་ཆོས་ཀྱི་དབང་རབ་ཏུ་འཐོབ་བོ།
en: (9) He attains power over Dharma because he displays the light of the Dharma entrance that is without edge or center. (10) He attains power over wisdom because he displays the tathāgata’s strengths, confidences and unique qualities, primary and secondary signs, and enlightenment.

source: །དེ་བྱང་ཆུབ་སེམས་དཔའི་དབང་བཅུ་པོ་འདི་དག་ཐོབ་མ་ཐག་ནས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡེ་ཤེས་དང་ལྡན་པ་ཡིན།
en: “When the bodhisattva attains those ten strengths, he simultaneously has inconceivable wisdom.

source: ཚད་མེད་པའི་ཡེ་ཤེས་དང་ལྡན་པ་ཡིན། ཡངས་པའི་ཡེ་ཤེས་དང་ལྡན་པ་ཡིན། མི་འཕྲོགས་པའི་ཡེ་ཤེས་དང་ལྡན་པ་ཡིན།
en: He has unequaled wisdom, he has limitless wisdom, he has vast wisdom, and he has invincible wisdom.

source: དེས་དེ་ལྟ་བུའི་རྗེས་སུ་སོང་ཞིང་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པས་ལུས་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་ཤིན་ཏུ་མེད་པ་ཡང་དག་པར་རྒྱུ་ཞིང་འབྱུང་བ་ཡིན།
en: “He who has reached this bhūmi and has those wisdoms acts with completely faultless actions and behavior of his body.

source: ངག་གི་ལས་ཁ་ན་མ་ཐོ་བ་ཤིན་ཏུ་མེད་པ་ཡང་དག་པར་རྒྱུ་ཞིང་འབྱུང་བ་ཡིན།
en: He acts with completely faultless actions and behavior of his speech, and he acts with completely faultless actions and behavior of his mind.

source: ཡིད་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་ཤིན་ཏུ་མེད་ཅིང་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་ཡེ་ཤེས་རྗེས་སུ་འབྲང་བ།
en: He has wisdom foremost and follows wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་དབང་སྒྱུར་བ།
en: He has gained the power of the perfection of wisdom.

source: སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བ་ཐབས་མཁས་པས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་སྨོན་ལམ་གྱིས་ཤིན་ཏུ་མངོན་པར་བསྒྲུབས་པ།
en: He is accompanied by great compassion. He has perfectly apportioned skillful methods. He has the complete accomplishment of his aspirations.

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་ཤིན་ཏུ་བརླབས་པ།
en: He has been well blessed by the blessing of the tathāgatas.

source: སེམས་ཅན་གྱི་དོན་བྱ་ཞིང་སྦྱོར་བ་རྒྱུན་མ་ཆད་པ།
en: He never ceases from his engagement in benefiting beings.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་རྣམ་པར་ཕྱེ་བ་ཡང་དག་པར་རྒྱུ་ཞིང་འབྱུང་ངོ་།
en: He is present in countless different universes.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལ་མདོར་བསྡུ་ན་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་འདི་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པའི་ཕྱིར་ཡང་དག་པར་རྒྱུ་ཞིང་འབྱུང་ངོ་།
en: “O jinaputras! In brief, the bodhisattva who has attained this bodhisattva bhūmi, Unwavering, has a conduct of physical, vocal, and mental activities that are the result of accomplishing the entire Dharma of the Buddha.

source: །དེ་ལྟར་དེས་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་འདི་ཐོབ་པས། ཉོན་མོངས་པའི་རྒྱུ་བ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་བསམ་པའི་སྟོབས་ཤིན་ཏུ་བརྟན་པ་ཡིན།
en: “Having attained this bodhisattva bhūmi called Unwavering, he has the power of stainless intention because of being free from the activity of all kleśas.

source: ལམ་དང་མི་འབྲལ་བའི་ཕྱིར་ལྷག་པའི་བསམ་པ་ཤིན་ཏུ་བརྟན་པ་ཡིན།
en: He has the power of stainless superior intention because he never departs from the path.

source: སེམས་ཅན་གྱི་དོན་ཡོངས་སུ་མི་གཏོད་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཤིན་ཏུ་བརྟན་པ་ཡིན།
en: He remains steadfastly within the power of compassion because he never abandons benefiting beings.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པའི་ཕྱིར་བྱམས་པ་ཆེན་པོའི་སྟོབས་ཤིན་ཏུ་བརྟན་པ་ཡིན།
en: He remains steadfastly within the power of great love because he protects all beings.

source: ཉམས་པ་མེད་པའི་ཆོས་དང་ལྡན་པའི་ཕྱིར་གཟུངས་ཀྱི་སྟོབས་ཤིན་ཏུ་བརྟན་པ་ཡིན།
en: He remains steadfastly within the power of retention because he never loses the Dharma.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བའི་བྱེ་བྲག་ལ་མཁས་པའི་ཕྱིར་སྤོབས་པའི་སྟོབས་ཤིན་ཏུ་བརྟན་པ་ཡིན།
en: He remains steadfastly within the power of confidence because he is wise in the classification of the entire Dharma of the Buddhas.

source: འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པར་སྤྱོད་པའི་རྣམ་པ་ལ་མཁས་པས་མངོན་པར་ཤེས་པའི་སྟོབས་ཤིན་ཏུ་བརྟན་པ་ཡིན།
en: He remains steadfastly within the power of clairvoyance because he is wise concerning the different conducts within infinite universes.

source: བྱང་ཆུབ་སེམས་དཔའི་བྱ་བ་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བས་སྨོན་ལམ་གྱི་སྟོབས་ཤིན་ཏུ་བརྟན་པ་ཡིན།
en: He remains steadfastly within the power of aspiration because he never abandons any of the activities of a bodhisattva.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབ་པའི་ཕྱིར། ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟོབས་ཤིན་ཏུ་བརྟན་པ་ཡིན།
en: He remains steadfastly within the power of the perfections because he accomplishes the entire Dharma of the Buddhas.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་ཏུ་གྱུར་པས། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་ཤིན་ཏུ་བརྟན་པ་ཡིན་ཏེ།
en: He remains steadfastly within the power of the blessing of the tathāgatas because he is always focused on attaining omniscient wisdom.

source: དེ་དེ་ལྟ་བུའི་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་པས་བྱ་བ་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་སྟོན་ལ་བྱ་བ་ཐམས་ཅད་ལ་ཁ་ན་མ་ཐོ་བ་འང་མེད་པ་ཡིན།
en: “He has attained those powers, displays all activities, and is faultless in all his activities.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱིས་བརྒྱད་པ་སྟེ། མི་འཕྲོགས་པའི་ཕྱིར་མི་གཡོ་བ་ཞེས་བྱའོ།
en: “O jinaputras! This is the eighth bhūmi of wisdom of the bodhisattva, and it is called Unwavering because it is invincible.

source: །ཡེ་ཤེས་མི་ཟློག་པའི་ཕྱིར་མི་འགྱུར་བ་ཞེས་བྱའོ།
en: It is called the changeless bhūmi because its wisdom is irreversible.

source: །འགྲོ་བ་ཐམས་ཅད་ཀྱིས་ཤེས་པར་དཀའ་བས་ན་ཐོབ་པར་དཀའ་བའི་ས་ཞེས་བྱའོ།
en: It is called the bhūmi difficult to attain because it is difficult for beings to comprehend it.

source: །ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཕྱིར་གཞོན་ནུའི་ས་ཞེས་བྱའོ།
en: It is called the bhūmi of youth because it is faultless.

source: །བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དབང་བསྒྱུར་བས་སྐྱེ་བའི་ས་ཞེས་བྱའོ།
en: It is called the bhūmi of birth because it has the power over all that is wished for.

source: །གཟོད་བྱ་བ་མེད་པས་ཡོངས་སུ་རྫོགས་པའི་ས་ཞེས་བྱའོ།
en: It is called the bhūmi of completion because there is nothing more to be done.

source: །ཡེ་ཤེས་ཀྱི་རྣམ་པར་དབྱེ་བ་ཤིན་ཏུ་བྱ་བས་མཐར་ཐུག་པའི་ས་ཞེས་བྱའོ།
en: It is called the bhūmi of perfection because it has the prefect completion of wisdom’s investigation.

source: །སྨོན་ལམ་ཤིན་ཏུ་མངོན་པར་བསྒྲུབ་པས་མྱ་ངན་ལས་འདས་པའི་ས་ཞེས་བྱའོ།
en: It is called the bhūmi of nirvāṇa because it is the fulfillment of aspirations.

source: །གཞན་གྱིས་རྣམ་པར་མི་འཁྲུགས་པས་བྱིན་གྱི་རླབས་ཀྱི་ས་ཞེས་བྱའོ།
en: It is called the bhūmi of dominance because it cannot be disturbed by anything else.

source: །སྔོན་གྱི་མཐར་མངོན་པར་བསྒྲུབས་པས་ལྷུན་གྱིས་གྲུབ་པའི་ས་ཞེས་བྱའོ།
en: It is called the bhūmi of effortlessness because the process of accomplishment is in the past.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུའི་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་དང་ལྡན་ཞིང་།
en: “O jinaputras!

source: སངས་རྒྱས་ཀྱི་རིགས་ཀྱི་རྗེས་སུ་སོང་བ། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱིས་ཤིན་ཏུ་གསལ་བར་གྱུར་པ། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ལམ་དང་། སྤྱོད་པ་དང་ཚུལ་གྱི་རྗེས་སུ་སོང་བ། སངས་རྒྱས་ཀྱི་ཡུལ་ལ་མངོན་དུ་གྱུར་པ་དེ་ནི་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་ཤིན་ཏུ་བརླབས་པ་ཡིན།
en: The bodhisattva accomplishes those wisdoms, enters the family of the Buddhas, illuminates the power of the qualities of the Buddha, follows the path of the conduct of the tathāgatas, is focused on the field of activity of the Buddhas, and is constantly empowered with the power of the tathāgatas;

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོས་རབ་ཏུ་བསྩུ་བ་ཡིན། ལག་ན་རྡོ་རྗེ་རྟག་པར་རྗེས་སུ་འབྲང་བ་ཡིན། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཡོངས་སུ་མ་བཏང་བ་ཡིན། ལུས་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པ་མངོན་པར་བསྒྲུབ་པ་ཡིན། ལུས་ཀྱི་སྤྱོད་པའི་སྟོབས་ཐམས་ཅད་དང་ལྡན་པ་ཡིན། མངོན་པར་ཤེས་པ་ཆེན་པོའི་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་རྫོགས་པ་ཡིན། ཏིང་ངེ་འཛིན་མཐའ་ཡས་པ་ལ་དབང་བསྒྱུར་བ་ཡིན། ལུང་བསྟན་པ་ཚད་མེད་པ་ཡང་དག་པར་ནོད་པ་ཡིན། ཡོངས་སུ་སྨིན་པའི་ཚུལ་བཞིན་དུ་འགྲོ་བ་རྣམས་ལ་མངོན་པར་འཚང་རྒྱ་བ་ཡོངས་སུ་སྟོན་པ་ཡིན་ཏེ།
en: he is welcomed by Śakra, Brahmā, and the lokapālas, he is constantly followed by Vajrapāṇi, he never abandons the power of samādhi, he accomplishes countless kinds of bodies, he is endowed with all the power of the conduct of all the bodies, he has perfected the ripening of great clairvoyance, he has power over infinite samādhis, he is the recipient of countless prophecies, and he displays enlightenment to those beings who have become fully ripened.

source: དེ་དེ་ལྟ་བུའི་ས་དང་ལྡན་ཞིང་ཐེག་པ་ཆེན་པོའི་དཀྱིལ་འཁོར་ལ་རབ་ཏུ་ཞུགས་པ་ཤིན་ཏུ་རྣམ་པར་དཔྱད་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་ཆེན་པོ་དང་ལྡན་པ། རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ཤེས་རབ་སྣང་བའི་འོད་གཟེར་གཏོང་བ། ཆོས་ཀྱི་དབྱིངས་ཆགས་པ་མེད་པའི་ལམ་དུ་ཞུགས་པ། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ལམ་རྣམ་པར་དབྱེ་བ་ལ་མཁས་པ། ཡོན་ཏན་གྱི་རྣམ་པ་ཐམས་ཅད་ཡང་དག་པར་སྟོན་པ། རང་གི་སེམས་བསྐྱེད་པ་ལ་དབང་བསྒྱུར་བ་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཤིན་ཏུ་རྟོགས་པའི་ཡེ་ཤེས་ཅན། བདུད་ཀྱི་ལམ་ཐམས་ཅད་ཡོངས་སུ་བཟློག་པའི་ཡེ་ཤེས་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པའི་ཡུལ་དང་སྤྱོད་ཡུལ་གྱི་རྗེས་སུ་ཞུགས་པ་ནི།
en: “He who has reached that bhūmi of wisdom enters the circle of the Mahāyāna, has great clairvoyance from wisdom’s investigation, continuously radiates the light of wisdom, follows without impediment the path of the Dharma’s realm, is skilled in the various worldly paths, displays the features of all good qualities, has the power over the arising of motivation in his own mind, has the wisdom that perfectly examines the past and future, possesses the knowledge of the following and turning away from the path of the māras, and enters the scope and field of activity of all the tathāgatas.

source: འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་ཤིང་མུ་མེད་པ་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཕྱིར་མི་ལྡོག་པའི་ཚུལ་གྱིས།
en: Without ever turning back he carries out bodhisattva conduct throughout the extent of infinite universes.

source: སྤྱོད་པས་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་ཐོབ་པ་ཡིན་ཞེས་བྱའོ།
en: “He is known as a bodhisattva who has attained the bodhisattva bhūmi called Unwavering.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱིས་མངོན་པར་བསྒྲུབས་པས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་པ་མཐོང་བ་དང་མི་འབྲལ་བ་ཡིན།
en: “O jinaputras! The bodhisattva who has attained the bodhisattva bhūmi called Unwavering never ceases from constantly seeing infinite tathāgatas because of his accomplishment of the power of samādhi.

source: སངས་རྒྱས་མཐོང་བ་ལ་མཆོད་ཅིང་བསྙེན་བཀུར་བ་རྒྱ་ཆེན་པོ་ཡང་ཡོངས་སུ་མི་གཏོང་སྟེ།
en: He never desists from a vast offering and service to the vision of the buddhas.

source: དེ་བསྐལ་པ་རེ་རེ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་རེ་རེ་དག་ཏུ་ཡང་སངས་རྒྱས་དུ་མ་དང་། སངས་རྒྱས་བརྒྱ་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་སྟོང་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་དུ་མ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ལ་རིམ་གྲོ་བྱེད་དོ། བཀུར་སྟི་བྱེད་དོ། །བསྟི་སྟང་བྱེད་དོ། །མཆོད་པ་བྱེད་དོ། །མཆོད་པ་མངོན་པར་བསྒྲུབ་པའི་རྣམ་པ་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་འབུལ་ལོ།
en: In every eon and every universe he serves, worships, honors, and makes offerings to many buddhas, many hundreds of buddhas, many thousands of buddhas, many hundreds of thousands of buddhas, many millions of buddhas, many tens of millions of buddhas, many billions of buddhas, many tens of billions of buddhas, many trillions of buddhas, and many quintillions of buddhas.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དབྱེ་བ་སྔོན་དུ་འགྲོ་བའི་ཆོས་སྣང་བ་ཉེ་བར་བསྒྲུབ་པ་ཡང་ཡང་དག་པར་ལེན་ཏོ།
en: “In attending to those tathāgatas he obtains first the different universes and then the acquisition of the light of the Dharma.

source: །དེ་སྔོན་པས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་མཛོད་རབ་ཏུ་ཐོབ་པས། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་ཕྱེ་བ་ཡོངས་སུ་བྲིས་པ་ཤིན་ཏུ་བསྟན་པས་མི་འཕྲོགས་པ་ཡིན།
en: Even more than before he attains the treasure of the Dharma of the tathāgatas, and he is invulnerable to worldly questions and instructions.

source: དེའི་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་ཤིན་ཏུ་བྱང་བ་དང་ཡོངས་སུ་དག་པ་དང་ཤིན་ཏུ་འོད་གསལ་ཞིང་དང་བར་གནས་པ་ཡིན།
en: “His roots of goodness will remain pure, will be purified, and will be very bright for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, many millions of eons, many tens of millions of eons, many billions of eons, many tens of billions of eons, many trillions of eons, and many quintillions of eons.

source: གསེར་གྱི་ས་ལེ་སྦྲམ་དེ་ཉིད་མགར་བ་མཁས་པ་དེས་ཡོངས་སུ་ཟིན་པར་གྱུར་ནས་འཛམ་བུའི་གླིང་གི་བདག་པོའི་མགུལ་ལམ་མགོ་ལ་བཏགས་ན་སེམས་ཅན་འཛམ་བུའི་གླིང་པ་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་རྣམ་པ་ཀུན་གྱིས་མི་ཐུབ་མི་འཕྲོགས་པ་ཡིན།
en: This is like when gold is taken by an expert goldsmith and placed on the throat or head of the sovereign of Jambudvīpa, it cannot be overcome by all the adornments of the beings who dwell in Jambudvīpa.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་དེ་དག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ནས་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བར་གྱིས་ཀྱང་མི་འཕྲོགས་པ་ཡིན།
en: “O jinaputras! In that same way the roots of goodness of the bodhisattva on this bodhisattva bhūmi called Unwavering cannot be overcome by those of the śrāvakas, pratyekabuddhas, and so on, up to bodhisattvas on the seventh bhūmi.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་འདི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་འོད་ཆེན་པོ་ནི་ཡེ་ཤེས་ཀྱི་སྒོ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བས་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པའི་མུན་པ་རབ་ཏུ་སེལ་ཏོ། །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ་དཔེར་ན།
en: “The great light of wisdom and knowledge of the bodhisattva on this bodhisattva bhūmi dispels the darkness of the kleśas of beings through accomplishing the doorways to wisdom. “O jinaputras!

source: སྟོང་ལ་དབང་བའི་ཚངས་པ་ནི། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱམས་པས་བཀང་ཞིང་འོད་ཀྱིས་སྣང་བར་བྱེད་དོ། །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བས་རྒྱས་པར་བཀང་ཞིང་། སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པའི་ཡོངས་སུ་གདུང་བ་མཐར་གྱིས་ཞི་བར་བྱེད་དོ། །ལུས་ཀྱང་ཤིན་ཏུ་ཚིམ་པར་བྱེད་དོ།
en: The bodhisattva who is on the bodhisattva bhūmi Unwavering pervades with the light of love universes as numerous as the atoms in a million buddha realms and completely pacifies the torment of kleśas in beings and brings them relief.

source: །དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་བཅུ་ལས་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཤས་ཆེ་བ་ཡིན་ཏེ། ལྷག་མ་རྣམས་ཀྱང་ཅི་ཚུལ་ཅི་ནུས་སུ་ཡང་དག་པར་མི་བསྒྲུབ་པ་མ་ཡིན་ནོ།
en: “From among the ten perfections, the perfection of aspiration predominates, and the other perfections are not accomplished fully and completely.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་ཞེས་བྱ་བ་སྟེ།
en: “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་མདོར་བསྟན་པའོ།
en: That in brief is the bodhisattva bhūmi Unwavering, the eighth bodhisattva bhūmi.

source: །རྒྱ་ཆེར་ནི་བསྐལ་པ་མུ་མེད་པས་བསྟན་པའི་མཐར་ཐུག་པར་ཤེས་པར་བྱའོ།
en: In detail, it could only be learned by a teaching that lasts for endless eons.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕལ་ཆེར་སྟོང་གི་བདག་པོ་ཚངས་པ་ཆེན་པོར་འགྱུར་ཏེ།
en: Most of the bodhisattvas on that bhūmi become Brahmā, the ruler of the universe.

source: གཞན་ཟིལ་གྱིས་གནོན་ཅིང་།
en: He overpowers all others, and no other can overpower him.

source: གཞན་གྱི་ཟིལ་གྱིས་མི་གནོན་པ་དང་། དོན་མཐོང་ཞིང་དབང་ཐོབ་པར་འགྱུར་ཏེ།
en: When he sees something, he has power over it.

source: སེམས་ཅན་རྣམས་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོན་པ་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ་ཡིན། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་ཕྱེ་བ་ཡོངས་སུ་དྲིས་པས་མི་འཕྲོགས་པ་ཡིན།
en: He is wise and powerful in teaching the perfections to beings, śrāvakas, pratyekabuddhas, and bodhisattvas, and he cannot be overcome by the questions and instructions of the various parts of the universes.

source: དེ་སྦྱིན་པ་འམ། ངག་སྙན་པ་འམ། དོན་བསྒྲུབ་པ་འམ། དོན་འཐུན་པས་དགེ་བའི་རྩ་བ་གང་ཅི་རྩོམ་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ཇི་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར། གཙོ་བོར་འགྱུར། ཐུ་བོར་འགྱུར། ཕུལ་དུ་འགྱུར།
en: “In whatever roots of goodness he accomplishes through generosity, kind words, actions that benefit others, and practicing what he preaches, he becomes supreme, the best, the foremost, the highest, the most excellent, the unsurpassable, the guide, the leader, the commander, and so on, up until becoming the omniscient one who is relied on.

source: དམ་པར་འགྱུར། བླ་ན་མེད་པར་འགྱུར། འདྲེན་པར་འགྱུར། ཡོངས་སུ་འདྲེན་པར་འགྱུར་བ་ནས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་བརྟེན་པའི་བར་དུ་འགྱུར་སྙམ་སྟེ། སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་། ཆོས་ཡིད་ལ་བྱ་བ་དང་། དགེ་འདུན་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡིད་ལ་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱ་བ་དང་། སྟོབས་ཡིད་ལ་བྱ་བ་དང་། མྱི་འཇིགས་པ་ཡིད་ལ་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་བྱ་བ་ནས་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་དུ་ཡིད་ལ་བྱ་བ་དང་། མྱི་འབྲལ་བ་ཡིན་ཏེ།
en: His mind is always focused on the Buddha, focused on the Dharma, focused on the Saṅgha, focused on the bodhisattvas, focused on bodhisattva conduct, focused on the bodhisattva bhūmis, focused on the perfections, focused on the strengths, focused on the confidences, focused on the unique qualities of buddhahood, and so on, up until being focused on the omniscient wisdom endowed with the supreme aspects.

source: དེ་འདོད་ན་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ། ཏིང་ངེ་འཛིན་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རབ་ཏུ་འཐོབ་ཅིང་དེ་དག་ལ་སྙོམས་པར་འཇུག་པ་དང་། སངས་རྒྱས་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མཐོང་བ་དང་། དེ་དག་གི་བྱིན་གྱི་རླབས་ཀྱང་ཡང་དག་པར་ཤེས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སྐྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་དུ་ཕྲ་བ་སྙེད་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སྣང་བར་བྱ་བ་དང་། སེམས་ཅན་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བསྐལ་པ་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་གནས་པར་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་བསྐལ་པ་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་རབ་ཏུ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྒོ་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རྣམ་པར་འབྱེད་པ་དང་། ལུས་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡོངས་སུ་བསྟན་པ་དང་། ལུས་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་རྩོམ་མོ། །དེ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་མཐུ་ཅན་རྣམས་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས། རྣམ་པར་འཕྲུལ་ཏེ་དེ་དག་གི་ལུས་སམ་འོད་དམ། རྫུ་འཕྲུལ་ལམ། མིག་གམ།
en: “If he wishes to, he can apply himself in such a way that in just one instant he attains as many samādhis as there are atoms in a million universes, sees as many buddhas as there are atoms in a million universes and knows their blessings, causes as many billion-world universes to shake as there are atoms in a million universes, goes to as many buddha realms as there are atoms in a million universes, illuminates as many universes as there are atoms in a million universes, ripens as many beings as there are atoms in a million universes, remains for as many eons as there are atoms in a million universes, comprehends as many previous and future eons as there are atoms in a million universes, opens as many Dharma doors as there are atoms in a million universes, manifests as many bodies as there are atoms in a million universes, and manifests each body having a retinue of as many bodhisattvas as there are atoms in a million universes.

source: སྤྱོད་ཡུལ་ལམ། དབྱངས་སམ།
en: That is the kind of diligence he undertakes.

source: སྤྱོད་པ་འམ། རྒྱན་ཏམ། བྱིན་གྱི་རླབས་སམ། མོས་པ་འམ། མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དག་བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་བར་གྱིས་ཀྱང་བགྲང་བར་དཀའོ།
en: “From this time onward the bodhisattvas who have the power of prayer through particular prayers manifest bodies, light, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and so on, until many quintillions of eons, which are difficult to enumerate.”

source: །དེ་དག་ས་བདུན་ཤེས་རབ་ཐབས་ཀྱིས་ལམ་སྦྱངས་ཤིང་།
en: “On the seventh bhūmi their path is purified through method and wisdom.

source: །ཤིན་དུ་མཆོག་བསྩགས་སྨོན་ལམ་ཆེན་པོ་རབ་བཏབ་པ།
en: They have the perfect accumulation and have made great prayers.

source: །མྱི་ཡི་དམ་པས་བྱིན་རླབས་དགེ་བའི་རྩ་ལྡན་ཞིང་།
en: They have been consecrated by the best of men and have acquired merit.
